app/Filters/AuthFilter.php

SELECT *
FROM `users`
WHERE `active` = 1
AND `users`.`id` = 1
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $id = session()->get('user_id');
        if (! $id || ! (new UserModel())->where('active', 1)->find($id)) {