app/Controllers/Auth.php

    public function attempt()
    {
        $username = trim((string) $this->request->getPost('username'));
        $password = (string) $this->request->getPost('password');
        $user = (new UserModel())->where('username', $username)->where('active', 1)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `active` = 1
 LIMIT 1