app/Controllers/Products.php

    public function index()
    {
        return view('products/index', ['items' => (new ProductModel())->where('active', 1)->orderBy('id', 'DESC')->findAll()]);
---
SELECT *
FROM `products`
WHERE `active` = 1
ORDER BY `id` DESC